Revit 2027 API
FamilySymbolProfile.YOffset Property
The offset of the profile to the origin of the sketch plane in the Y direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double YOffset { get; set; }
Public Property YOffset As Double
	Get
	Set
public:
property double YOffset {
	double get ();
	void set (double value);
}
member YOffset : float with get, set
Property Value
Double
See Also
Reference
FamilySymbolProfile Class
Autodesk.Revit.DB Namespace